In [1]:
import string

In [2]:
import pandas as pd
import numpy as np

In [3]:
t = pd.Series(np.arange(10,20), index=list(string.ascii_uppercase[:10]))
print(t)
type(t)

A    10
B    11
C    12
D    13
E    14
F    15
G    16
H    17
I    18
J    19
dtype: int64

pandas.core.series.Series

In [4]:
a = {string.ascii_uppercase[i]:i for i in range(10)}
a

{'A': 0,
 'B': 1,
 'C': 2,
 'D': 3,
 'E': 4,
 'F': 5,
 'G': 6,
 'H': 7,
 'I': 8,
 'J': 9}

In [5]:
pd.Series(a)

A    0
B    1
C    2
D    3
E    4
F    5
G    6
H    7
I    8
J    9
dtype: int64

In [6]:
pd.Series(a,index=list(string.ascii_uppercase[3:10]))

D    3
E    4
F    5
G    6
H    7
I    8
J    9
dtype: int64

In [7]:
t

A    10
B    11
C    12
D    13
E    14
F    15
G    16
H    17
I    18
J    19
dtype: int64

In [8]:
t[["A", "a"]]

/usr/local/lib/python3.6/dist-packages/pandas-0.25.3-py3.6-linux-x86_64.egg/pandas/core/series.py:1155: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#deprecate-loc-reindex-listlike
  return self.loc[key]

A    10.0
a     NaN
dtype: float64

In [9]:
t.index

Index(['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J'], dtype='object')

In [10]:
type(t.values)

numpy.ndarray

In [11]:
df =pd.read_csv("./dogNames2.csv")
print(df)

      Row_Labels  Count_AnimalName
0              1                 1
1              2                 2
2          40804                 1
3          90201                 1
4          90203                 1
...          ...               ...
16215      37916                 1
16216      38282                 1
16217      38583                 1
16218      38948                 1
16219      39743                 1

[16220 rows x 2 columns]

In [12]:
type(df)

pandas.core.frame.DataFrame

In [13]:
t1 = pd.DataFrame(np.arange(12).reshape((3,4)),
                  index=list(string.ascii_lowercase[:3]),
                  columns=list(string.ascii_uppercase[-4:])
                  )
print(t1)

   W  X   Y   Z
a  0  1   2   3
b  4  5   6   7
c  8  9  10  11

In [14]:
#按列创建
d1 = {"name":["xiaoming","Wang"], "age":[22, 33], "tel":[10010, 10086]}
d1
t1 = pd.DataFrame(d1)
print(t1)

       name  age    tel
0  xiaoming   22  10010
1      Wang   33  10086

In [15]:
# 按行创建
d2 = [{"name":"xiaohong", "age":32, "tel":10086},{"name":"xiaoming","tel":22},
     {"name":"wang", "age":18}]
print(d2)
t2 = pd.DataFrame(d2)
t2

[{'name': 'xiaohong', 'age': 32, 'tel': 10086}, {'name': 'xiaoming', 'tel': 22}, {'name': 'wang', 'age': 18}]

       name   age      tel
0  xiaohong  32.0  10086.0
1  xiaoming   NaN     22.0
2      wang  18.0      NaN

In [16]:
t2.index

RangeIndex(start=0, stop=3, step=1)

In [17]:
t2.columns

Index(['name', 'age', 'tel'], dtype='object')

In [18]:
t2.values

array([['xiaohong', 32.0, 10086.0],
       ['xiaoming', nan, 22.0],
       ['wang', 18.0, nan]], dtype=object)

In [19]:
t2.dtypes
print(t2.info())
print(t2.describe())
print(t2)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
name    3 non-null object
age     2 non-null float64
tel     2 non-null float64
dtypes: float64(2), object(1)
memory usage: 200.0+ bytes
None
             age           tel
count   2.000000      2.000000
mean   25.000000   5054.000000
std     9.899495   7116.322646
min    18.000000     22.000000
25%    21.500000   2538.000000
50%    25.000000   5054.000000
75%    28.500000   7570.000000
max    32.000000  10086.000000
       name   age      tel
0  xiaohong  32.0  10086.0
1  xiaoming   NaN     22.0
2      wang  18.0      NaN

In [20]:
t3 = pd.DataFrame(np.arange(12).reshape((3,4)), index=list("abc"), 
                  columns=list("WXYZ"))
t3
t3.mean()

W    4.0
X    5.0
Y    6.0
Z    7.0
dtype: float64

In [103]:
t3.iloc[1:3,0:2]= np.nan
print(t3)
t3.dropna(axis=0,how="any")
t3[pd.notnull(t3)]
t3[pd.notnull(t3["W"])]
#pd.isnull(t3)

     W    X   Y   Z
a  0.0  1.0   2   3
b  NaN  NaN   6   7
c  NaN  NaN  10  11

     W    X  Y  Z
a  0.0  1.0  2  3

In [22]:
#t3[pd.isnull(t3)] = 88
t3["X"] = t3["X"].fillna(t3["X"].mean())
t3

     W    X   Y   Z
a  0.0  1.0   2   3
b  NaN  1.0   6   7
c  NaN  1.0  10  11

In [23]:
t3.fillna(t3.mean())

     W    X   Y   Z
a  0.0  1.0   2   3
b  0.0  1.0   6   7
c  0.0  1.0  10  11

In [24]:
df = pd.read_csv("./IMDB-Movie-Data.csv")
#print(df.info())
temp_list = df["Genre"].str.split(",").tolist()
list(set([i for j in temp_list for i in j]))

['History',
 'Adventure',
 'Musical',
 'Thriller',
 'Fantasy',
 'Animation',
 'Action',
 'Family',
 'Romance',
 'Horror',
 'Sci-Fi',
 'Drama',
 'Biography',
 'Comedy',
 'Music',
 'Sport',
 'Western',
 'Crime',
 'Mystery',
 'War']

In [25]:
df["Rating"].mean()

len(list(df["Actors"].str.split(", ")))

set([i for j in df["Actors"].str.split(", ") for i in j])
df.info()

df["Runtime (Minutes)"].argmax()
df["Runtime (Minutes)"].median()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 12 columns):
Rank                  1000 non-null int64
Title                 1000 non-null object
Genre                 1000 non-null object
Description           1000 non-null object
Director              1000 non-null object
Actors                1000 non-null object
Year                  1000 non-null int64
Runtime (Minutes)     1000 non-null int64
Rating                1000 non-null float64
Votes                 1000 non-null int64
Revenue (Millions)    872 non-null float64
Metascore             936 non-null float64
dtypes: float64(3), int64(4), object(5)
memory usage: 93.9+ KB

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:8: FutureWarning:
The current behaviour of 'Series.argmax' is deprecated, use 'idxmax'
instead.
The behavior of 'argmax' will be corrected to return the positional
maximum in the future. For now, use 'series.values.argmax' or
'np.argmax(np.array(values))' to get the position of the maximum
row.

111.0

In [26]:
df1 = pd.DataFrame(np.ones((2,4)),index=list("ab"), columns=list("ABCD"))
print(df1)

df2 = pd.DataFrame(np.zeros((3,3)), index=list("abc"), columns=list("XYZ"))
df2

     A    B    C    D
a  1.0  1.0  1.0  1.0
b  1.0  1.0  1.0  1.0

     X    Y    Z
a  0.0  0.0  0.0
b  0.0  0.0  0.0
c  0.0  0.0  0.0

In [27]:
df1.join(df2)

     A    B    C    D    X    Y    Z
a  1.0  1.0  1.0  1.0  0.0  0.0  0.0
b  1.0  1.0  1.0  1.0  0.0  0.0  0.0

In [28]:
df2.join(df1)

     X    Y    Z    A    B    C    D
a  0.0  0.0  0.0  1.0  1.0  1.0  1.0
b  0.0  0.0  0.0  1.0  1.0  1.0  1.0
c  0.0  0.0  0.0  NaN  NaN  NaN  NaN

In [29]:
df1 = pd.DataFrame(np.ones((3,4)),index=list("ABC"), columns=list("MNOP"))
df1.loc["A","O"] = "a"
df1.loc["B","O"] = "b"
df1.loc["C","O"] = "c"
print(df1)


df2 = pd.DataFrame(np.zeros((2,5)), index=list("AB"), columns=list("VWXYZ"))
df2.loc["A", "X"] = "c"
df2.loc["B", "X"] = "d"
df2

     M    N  O    P
A  1.0  1.0  a  1.0
B  1.0  1.0  b  1.0
C  1.0  1.0  c  1.0

     V    W  X    Y    Z
A  0.0  0.0  c  0.0  0.0
B  0.0  0.0  d  0.0  0.0

In [30]:
df1.merge(df2, left_on="O", right_on="X")

     M    N  O    P    V    W  X    Y    Z
0  1.0  1.0  c  1.0  0.0  0.0  c  0.0  0.0

In [31]:
df1.merge(df2, left_on="O", right_on="X", how="inner")

     M    N  O    P    V    W  X    Y    Z
0  1.0  1.0  c  1.0  0.0  0.0  c  0.0  0.0

In [32]:
df1.merge(df2, left_on="O", right_on="X", how="outer")

     M    N    O    P    V    W    X    Y    Z
0  1.0  1.0    a  1.0  NaN  NaN  NaN  NaN  NaN
1  1.0  1.0    b  1.0  NaN  NaN  NaN  NaN  NaN
2  1.0  1.0    c  1.0  0.0  0.0    c  0.0  0.0
3  NaN  NaN  NaN  NaN  0.0  0.0    d  0.0  0.0

In [33]:
df1.merge(df2, left_on="O", right_on="X", how="left")

     M    N  O    P    V    W    X    Y    Z
0  1.0  1.0  a  1.0  NaN  NaN  NaN  NaN  NaN
1  1.0  1.0  b  1.0  NaN  NaN  NaN  NaN  NaN
2  1.0  1.0  c  1.0  0.0  0.0    c  0.0  0.0

In [34]:
help(df1.merge)

Help on method merge in module pandas.core.frame:

merge(right, how='inner', on=None, left_on=None, right_on=None, left_index=False, right_index=False, sort=False, suffixes=('_x', '_y'), copy=True, indicator=False, validate=None) method of pandas.core.frame.DataFrame instance
    Merge DataFrame or named Series objects with a database-style join.

    The join is done on columns or indexes. If joining columns on
    columns, the DataFrame indexes *will be ignored*. Otherwise if joining indexes
    on indexes or indexes on a column or columns, the index will be passed on.

    Parameters
    ----------
    right : DataFrame or named Series
        Object to merge with.
    how : {'left', 'right', 'outer', 'inner'}, default 'inner'
        Type of merge to be performed.

        * left: use only keys from left frame, similar to a SQL left outer join;
          preserve key order.
        * right: use only keys from right frame, similar to a SQL right outer join;
          preserve key order.
        * outer: use union of keys from both frames, similar to a SQL full outer
          join; sort keys lexicographically.
        * inner: use intersection of keys from both frames, similar to a SQL inner
          join; preserve the order of the left keys.
    on : label or list
        Column or index level names to join on. These must be found in both
        DataFrames. If `on` is None and not merging on indexes then this defaults
        to the intersection of the columns in both DataFrames.
    left_on : label or list, or array-like
        Column or index level names to join on in the left DataFrame. Can also
        be an array or list of arrays of the length of the left DataFrame.
        These arrays are treated as if they are columns.
    right_on : label or list, or array-like
        Column or index level names to join on in the right DataFrame. Can also
        be an array or list of arrays of the length of the right DataFrame.
        These arrays are treated as if they are columns.
    left_index : bool, default False
        Use the index from the left DataFrame as the join key(s). If it is a
        MultiIndex, the number of keys in the other DataFrame (either the index
        or a number of columns) must match the number of levels.
    right_index : bool, default False
        Use the index from the right DataFrame as the join key. Same caveats as
        left_index.
    sort : bool, default False
        Sort the join keys lexicographically in the result DataFrame. If False,
        the order of the join keys depends on the join type (how keyword).
    suffixes : tuple of (str, str), default ('_x', '_y')
        Suffix to apply to overlapping column names in the left and right
        side, respectively. To raise an exception on overlapping columns use
        (False, False).
    copy : bool, default True
        If False, avoid copy if possible.
    indicator : bool or str, default False
        If True, adds a column to output DataFrame called "_merge" with
        information on the source of each row.
        If string, column with information on source of each row will be added to
        output DataFrame, and column will be named value of string.
        Information column is Categorical-type and takes on a value of "left_only"
        for observations whose merge key only appears in 'left' DataFrame,
        "right_only" for observations whose merge key only appears in 'right'
        DataFrame, and "both" if the observation's merge key is found in both.

    validate : str, optional
        If specified, checks if merge is of specified type.

        * "one_to_one" or "1:1": check if merge keys are unique in both
          left and right datasets.
        * "one_to_many" or "1:m": check if merge keys are unique in left
          dataset.
        * "many_to_one" or "m:1": check if merge keys are unique in right
          dataset.
        * "many_to_many" or "m:m": allowed, but does not result in checks.

        .. versionadded:: 0.21.0

    Returns
    -------
    DataFrame
        A DataFrame of the two merged objects.

    See Also
    --------
    merge_ordered : Merge with optional filling/interpolation.
    merge_asof : Merge on nearest keys.
    DataFrame.join : Similar method using indices.

    Notes
    -----
    Support for specifying index levels as the `on`, `left_on`, and
    `right_on` parameters was added in version 0.23.0
    Support for merging named Series objects was added in version 0.24.0

    Examples
    --------

    >>> df1 = pd.DataFrame({'lkey': ['foo', 'bar', 'baz', 'foo'],
    ...                     'value': [1, 2, 3, 5]})
    >>> df2 = pd.DataFrame({'rkey': ['foo', 'bar', 'baz', 'foo'],
    ...                     'value': [5, 6, 7, 8]})
    >>> df1
        lkey value
    0   foo      1
    1   bar      2
    2   baz      3
    3   foo      5
    >>> df2
        rkey value
    0   foo      5
    1   bar      6
    2   baz      7
    3   foo      8

    Merge df1 and df2 on the lkey and rkey columns. The value columns have
    the default suffixes, _x and _y, appended.

    >>> df1.merge(df2, left_on='lkey', right_on='rkey')
      lkey  value_x rkey  value_y
    0  foo        1  foo        5
    1  foo        1  foo        8
    2  foo        5  foo        5
    3  foo        5  foo        8
    4  bar        2  bar        6
    5  baz        3  baz        7

    Merge DataFrames df1 and df2 with specified left and right suffixes
    appended to any overlapping columns.

    >>> df1.merge(df2, left_on='lkey', right_on='rkey',
    ...           suffixes=('_left', '_right'))
      lkey  value_left rkey  value_right
    0  foo           1  foo            5
    1  foo           1  foo            8
    2  foo           5  foo            5
    3  foo           5  foo            8
    4  bar           2  bar            6
    5  baz           3  baz            7

    Merge DataFrames df1 and df2, but raise an exception if the DataFrames have
    any overlapping columns.

    >>> df1.merge(df2, left_on='lkey', right_on='rkey', suffixes=(False, False))
    Traceback (most recent call last):
    ...
    ValueError: columns overlap but no suffix specified:
        Index(['value'], dtype='object')

In [35]:
df = pd.read_csv("./starbucks_store_worldwide.csv")
df.info()
grouped = df.groupby(by="Country")
print("*"*20)
list_temp  = []
for i in grouped:
    list_temp.append(i)
print("*"*20)
len(list_temp)


df["Brand"].unique()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25600 entries, 0 to 25599
Data columns (total 13 columns):
Brand             25600 non-null object
Store Number      25600 non-null object
Store Name        25600 non-null object
Ownership Type    25600 non-null object
Street Address    25598 non-null object
City              25585 non-null object
State/Province    25600 non-null object
Country           25600 non-null object
Postcode          24078 non-null object
Phone Number      18739 non-null object
Timezone          25600 non-null object
Longitude         25599 non-null float64
Latitude          25599 non-null float64
dtypes: float64(2), object(11)
memory usage: 2.5+ MB
********************
********************

array(['Starbucks', 'Teavana', 'Evolution Fresh', 'Coffee House Holdings'],
      dtype=object)

In [36]:
count = grouped["Brand"].count()
print(grouped["Brand"].count())
count.sort_values()

Country
AD        1
AE      144
AR      108
AT       18
AU       22
      ...
TT        3
TW      394
US    13608
VN       25
ZA        3
Name: Brand, Length: 73, dtype: int64

Country
AD        1
MC        2
LU        2
TT        3
SK        3
      ...
KR      993
JP     1237
CA     1468
CN     2734
US    13608
Name: Brand, Length: 73, dtype: int64

In [37]:
len(df["Country"].unique())

73

In [38]:
china = df[df["Country"]=="CN"]
china.groupby(by="State/Province").count()["Brand"]

State/Province
11    236
12     58
13     24
14      8
15      8
21     57
22     13
23     16
31    551
32    354
33    315
34     26
35     75
36     13
37     75
41     21
42     76
43     35
44    333
45     21
46     16
50     41
51    104
52      9
53     24
61     42
62      3
63      3
64      2
91    162
92     13
Name: Brand, dtype: int64

In [39]:
a = df["Brand"].groupby(by=[df["Country"], df["State/Province"]]).count()
a

Country  State/Province
AD       7                  1
AE       AJ                 2
         AZ                48
         DU                82
         FU                 2
                           ..
US       WV                25
         WY                23
VN       HN                 6
         SG                19
ZA       GT                 3
Name: Brand, Length: 545, dtype: int64

In [40]:
a.index

MultiIndex([('AD',  '7'),
            ('AE', 'AJ'),
            ('AE', 'AZ'),
            ('AE', 'DU'),
            ('AE', 'FU'),
            ('AE', 'RK'),
            ('AE', 'SH'),
            ('AE', 'UQ'),
            ('AR',  'B'),
            ('AR',  'C'),
            ...
            ('US', 'UT'),
            ('US', 'VA'),
            ('US', 'VT'),
            ('US', 'WA'),
            ('US', 'WI'),
            ('US', 'WV'),
            ('US', 'WY'),
            ('VN', 'HN'),
            ('VN', 'SG'),
            ('ZA', 'GT')],
           names=['Country', 'State/Province'], length=545)

In [41]:
list(range(10))

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

In [42]:
df2.set_index("V", drop=False).index

Float64Index([0.0, 0.0], dtype='float64', name='V')

In [43]:
df2.set_index(["V","W","X"],drop=False).index

MultiIndex([(0.0, 0.0, 'c'),
            (0.0, 0.0, 'd')],
           names=['V', 'W', 'X'])

In [44]:
df2

     V    W  X    Y    Z
A  0.0  0.0  c  0.0  0.0
B  0.0  0.0  d  0.0  0.0

In [53]:
a = df2.set_index(["V","Y"],drop=False)
a.index.unique()

MultiIndex([(0.0, 0.0)],
           names=['V', 'Y'])

In [80]:
a = pd.DataFrame({'a': range(7),'b': range(7, 0, -1),'c': ['one','one','one','two','two','two', 'two'],'d': list("hjklmno")})
print(a)

a[["d","c"]]

   a  b    c  d
0  0  7  one  h
1  1  6  one  j
2  2  5  one  k
3  3  4  two  l
4  4  3  two  m
5  5  2  two  n
6  6  1  two  o

   d    c
0  h  one
1  j  one
2  k  one
3  l  two
4  m  two
5  n  two
6  o  two

In [70]:
X = a.set_index(["c", "d"])["a"]
print(X)
X["one"]["k"]

c    d
one  h    0
     j    1
     k    2
two  l    3
     m    4
     n    5
     o    6
Name: a, dtype: int64

2

In [67]:
X.swaplevel()

d  c
h  one    0
j  one    1
k  one    2
l  two    3
m  two    4
n  two    5
o  two    6
Name: a, dtype: int64

In [65]:
X.index.levels

FrozenList([['one', 'two'], ['h', 'j', 'k', 'l', 'm', 'n', 'o']])

In [73]:
x = a.set_index(["c","d"])
x

       a  b
c   d
one h  0  7
    j  1  6
    k  2  5
two l  3  4
    m  4  3
    n  5  2
    o  6  1

In [75]:
x.loc["one"].loc["j"]

a    1
b    6
Name: j, dtype: int64

In [124]:
# 每月第3周的星期五，每月第几周的星期几
pd.date_range(start="20191204", periods=10, freq="WOM-3FRI")

DatetimeIndex(['2019-12-20', '2020-01-17', '2020-02-21', '2020-03-20',
               '2020-04-17', '2020-05-15', '2020-06-19', '2020-07-17',
               '2020-08-21', '2020-09-18'],
              dtype='datetime64[ns]', freq='WOM-3FRI')

In [139]:
index = pd.date_range("20191204", periods=10)
print(index)
df = pd.DataFrame(np.random.rand(10), index=index)
df

DatetimeIndex(['2019-12-04', '2019-12-05', '2019-12-06', '2019-12-07',
               '2019-12-08', '2019-12-09', '2019-12-10', '2019-12-11',
               '2019-12-12', '2019-12-13'],
              dtype='datetime64[ns]', freq='D')

                   0
2019-12-04  0.921666
2019-12-05  0.911665
2019-12-06  0.701656
2019-12-07  0.187824
2019-12-08  0.573621
2019-12-09  0.802482
2019-12-10  0.427864
2019-12-11  0.095475
2019-12-12  0.254390
2019-12-13  0.593468

In [145]:
df = pd.read_csv("911.csv")
df.head(1)
a = pd.to_datetime(df["timeStamp"])
a.dtype

dtype('<M8[ns]')

In [158]:
t = pd.DataFrame(np.random.uniform(10,50,(100,1)), 
            index=pd.date_range(start="20191202",periods=100))
t
t.index

DatetimeIndex(['2019-12-02', '2019-12-03', '2019-12-04', '2019-12-05',
               '2019-12-06', '2019-12-07', '2019-12-08', '2019-12-09',
               '2019-12-10', '2019-12-11', '2019-12-12', '2019-12-13',
               '2019-12-14', '2019-12-15', '2019-12-16', '2019-12-17',
               '2019-12-18', '2019-12-19', '2019-12-20', '2019-12-21',
               '2019-12-22', '2019-12-23', '2019-12-24', '2019-12-25',
               '2019-12-26', '2019-12-27', '2019-12-28', '2019-12-29',
               '2019-12-30', '2019-12-31', '2020-01-01', '2020-01-02',
               '2020-01-03', '2020-01-04', '2020-01-05', '2020-01-06',
               '2020-01-07', '2020-01-08', '2020-01-09', '2020-01-10',
               '2020-01-11', '2020-01-12', '2020-01-13', '2020-01-14',
               '2020-01-15', '2020-01-16', '2020-01-17', '2020-01-18',
               '2020-01-19', '2020-01-20', '2020-01-21', '2020-01-22',
               '2020-01-23', '2020-01-24', '2020-01-25', '2020-01-26',
               '2020-01-27', '2020-01-28', '2020-01-29', '2020-01-30',
               '2020-01-31', '2020-02-01', '2020-02-02', '2020-02-03',
               '2020-02-04', '2020-02-05', '2020-02-06', '2020-02-07',
               '2020-02-08', '2020-02-09', '2020-02-10', '2020-02-11',
               '2020-02-12', '2020-02-13', '2020-02-14', '2020-02-15',
               '2020-02-16', '2020-02-17', '2020-02-18', '2020-02-19',
               '2020-02-20', '2020-02-21', '2020-02-22', '2020-02-23',
               '2020-02-24', '2020-02-25', '2020-02-26', '2020-02-27',
               '2020-02-28', '2020-02-29', '2020-03-01', '2020-03-02',
               '2020-03-03', '2020-03-04', '2020-03-05', '2020-03-06',
               '2020-03-07', '2020-03-08', '2020-03-09', '2020-03-10'],
              dtype='datetime64[ns]', freq='D')

In [167]:
list(t.resample("M"))[0][1]

                    0
2019-12-02  49.804299
2019-12-03  38.842502
2019-12-04  34.571684
2019-12-05  21.322170
2019-12-06  25.121762
2019-12-07  26.849407
2019-12-08  21.845094
2019-12-09  33.349542
2019-12-10  11.997205
2019-12-11  30.987851
2019-12-12  22.424978
2019-12-13  20.892085
2019-12-14  32.530849
2019-12-15  47.502933
2019-12-16  15.195750
2019-12-17  32.747177
2019-12-18  12.211001
2019-12-19  23.562314
2019-12-20  41.098238
2019-12-21  38.358922
2019-12-22  21.106137
2019-12-23  40.136310
2019-12-24  27.126633
2019-12-25  43.800199
2019-12-26  44.887659
2019-12-27  42.223445
2019-12-28  21.073798
2019-12-29  31.423267
2019-12-30  29.834285
2019-12-31  27.618043